{"config": [{"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "batch_input_shape": [null, 30, 30, 1], "name": "conv2d_1", "kernel_size": [3, 3], "trainable": true, "use_bias": true, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "dtype": "float32", "filters": 32, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "kernel_size": [3, 3], "trainable": true, "use_bias": true, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "filters": 64, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "trainable": true, "units": 25, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "use_bias": true, "trainable": true, "units": 2, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}